package org.ssu.edu.teachua.utils;

import org.testng.annotations.DataProvider;

public class DataProviderTua328 {
    @DataProvider(name = "dpTua328")
    public static Object[][] dpTua328() {
        return new Object[][]{
                {"AfBbCcDdEeFfGgHhIiJjKkLlMmNn", "Будь ласка введіть Ваше ім'я\nІм'я не може містити більше, ніж 25 символів"},
                {"!@#$%^&,", "Будь ласка введіть Ваше ім'я\nІм'я не може містити спеціальні символи"},
                {"1234", "Ім'я не може містити цифри"},
                {"-Name", "Ім'я повинно починатися і закінчуватися літерою"},
                {" Name", "Ім'я не може містити спеціальні символи"},
                {"`Name", "Ім'я повинно починатися і закінчуватися літерою"},
                {"Name", "Ім'я повинно починатися і закінчуватися літерою"},
                {"Name ", "Ім'я не може містити спеціальні символи"},
                {"Name`", "Ім'я повинно починатися та закінчуватися літерою"}
        };
    }
}
